# Assignment #7 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Tori Hogrebe Guide
</br>
Date: 04/10/25
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy/SQlConnector on our local server and locally on our machine.
<br>

Now we will populate and create **all** tables for our dataset into our database and finalize our ERR diagram.<br>

We created a database three different ways in our previous assignment; One database on our local MySQL server, one test database stored locally that integrates with MySQL and one test database stored only locally as a .db file on your machine. Now we will create all tables and populate your tables with your data from your dataset (Feel free to practice with all methods, but it is encouraged to use the first method that will allow you to create your schema diagram). After populating your database, create a visual database schema diagram in MySQL Workbench. <br>
<br>
Be sure to comment all code. Include a .png image of your database schema from MySQL Workbench in your Blackboard submission or Github repository.

In [5]:
from sqlalchemy import create_engine, text
import pandas as pd
import mysql.connector

df = pd.read_csv("education_career_success.csv")
df.head()

,Student_ID,Age,Gender,High_School_GPA,SAT_Score,University_Ranking,University_GPA,Field_of_Study,Internships_Completed,Projects_Completed,Certifications,Soft_Skills_Score,Networking_Score,Job_Offers,Starting_Salary,Career_Satisfaction,Years_to_Promotion,Current_Job_Level,Work_Life_Balance,Entrepreneurship
0,S00001,24,Male,3.58,1052,291,3.96,Arts,3,7,2,9,8,5,27200.0,4,5,Entry,7,No
1,S00002,21,Other,2.52,1211,112,3.63,Law,4,7,3,8,1,4,25000.0,1,1,Mid,7,No
2,S00003,28,Female,3.42,1193,715,2.63,Medicine,4,8,1,1,9,0,42400.0,9,3,Entry,7,No
3,S00004,25,Male,2.43,1497,170,2.81,Computer Science,3,9,1,10,6,1,57400.0,7,5,Mid,5,No
4,S00005,22,Male,2.08,1012,599,2.48,Engineering,4,6,4,10,9,4,47600.0,9,5,Entry,2,No

In [25]:
from sqlalchemy import create_engine, text

# Connect to the MySQL database
engine = create_engine("mysql+mysqlconnector://root:milo200282@localhost/education_career_db")

with engine.connect() as connection:
    
    # Create base student table
    connection.execute(text("""
        CREATE TABLE IF NOT EXISTS students (
            Student_ID VARCHAR(10) PRIMARY KEY
        );
    """))

    # Academic details
    connection.execute(text("""
        CREATE TABLE IF NOT EXISTS academics (
            Student_ID VARCHAR(10),
            Age INT,
            Gender VARCHAR(10),
            High_School_GPA FLOAT,
            SAT_Score INT,
            University_Ranking INT,
            University_GPA FLOAT,
            Field_of_Study VARCHAR(50),
            FOREIGN KEY (Student_ID) REFERENCES students(Student_ID)
        );
    """))

    # Skill development
    connection.execute(text("""
        CREATE TABLE IF NOT EXISTS skills (
            Student_ID VARCHAR(10),
            Internships_Completed INT,
            Projects_Completed INT,
            Certifications INT,
            Soft_Skills_Score INT,
            Networking_Score INT,
            FOREIGN KEY (Student_ID) REFERENCES students(Student_ID)
        );
    """))

    # Career outcomes
    connection.execute(text("""
        CREATE TABLE IF NOT EXISTS career_outcomes (
            Student_ID VARCHAR(10),
            Job_Offers INT,
            Starting_Salary FLOAT,
            Career_Satisfaction INT,
            Years_to_Promotion INT,
            Current_Job_Level VARCHAR(20),
            Work_Life_Balance INT,
            Entrepreneurship VARCHAR(5),
            FOREIGN KEY (Student_ID) REFERENCES students(Student_ID)
        );
    """))

print("✅ All normalized tables created with foreign key relationships!")

✅ All normalized tables created with foreign key relationships!

In [27]:
# Import libraries
import pandas as pd
from sqlalchemy import create_engine

# Load the dataset
df = pd.read_csv("education_career_success.csv")

# Split the dataframe by table
df_students = df[["Student_ID"]].drop_duplicates()

df_academics = df[[
    "Student_ID", "Age", "Gender", "High_School_GPA", "SAT_Score",
    "University_Ranking", "University_GPA", "Field_of_Study"
]]

df_skills = df[[
    "Student_ID", "Internships_Completed", "Projects_Completed",
    "Certifications", "Soft_Skills_Score", "Networking_Score"
]]

df_career = df[[
    "Student_ID", "Job_Offers", "Starting_Salary", "Career_Satisfaction",
    "Years_to_Promotion", "Current_Job_Level", "Work_Life_Balance",
    "Entrepreneurship"
]]

# Create SQLAlchemy engine
engine = create_engine("mysql+mysqlconnector://root:milo200282@localhost/education_career_db")

# Upload data to MySQL tables
df_students.to_sql("students", con=engine, if_exists="append", index=False)
df_academics.to_sql("academics", con=engine, if_exists="append", index=False)
df_skills.to_sql("skills", con=engine, if_exists="append", index=False)
df_career.to_sql("career_outcomes", con=engine, if_exists="append", index=False)

print("✅ All tables populated successfully!")

✅ All tables populated successfully!

In [29]:
# Count records in each table using SQL
from sqlalchemy import text

with engine.connect() as connection:
    for table in ["students", "academics", "skills", "career_outcomes"]:
        result = connection.execute(text(f"SELECT COUNT(*) FROM {table}"))
        count = result.scalar()
        print(f"{table}: {count} rows")

students: 5000 rows
academics: 5000 rows
skills: 5000 rows
career_outcomes: 5000 rows

In [31]:
from sqlalchemy import create_engine
import pandas as pd
# This creates a file named 'education_local.db' in your current working directory
engine = create_engine("sqlite:///education_local.db")
df_students.to_sql("students", con=engine, if_exists="replace", index=False)
df_academics.to_sql("academics", con=engine, if_exists="replace", index=False)
df_skills.to_sql("skills", con=engine, if_exists="replace", index=False)
df_career.to_sql("career_outcomes", con=engine, if_exists="replace", index=False)

5000

In [33]:
#Close the database connection :)
conn.close()

**MySQL Workbench**<br>
To export your database schema as a .PNG:<br>
->Go to your EER Diagram<br>
->File<br>
->Export<br>
->Export as .PNG